using UnityEngine;

public class SingletonTest0 : MonoBehaviour
{
    // 싱글톤 패턴이란?? -> SingletonTest ~
    // - 하나의 클래스에서 단 하나의 인스턴스만 존재하게 하는 패턴
    // - 전역적으로 하나의 인스턴스만 필요할 때 (각종 Manager)

    // - 무분별하게 사용 시 코드가 점점 의존적으로 얽히게 되고, 유지보수가 어려워짐


    // 유니티에서 싱글톤 구현 방법 -> SingletonTest2 ~
    // - MonoBehaviour
    //   - 일반적인 구현방법과 차이가 있음

    // 싱글톤 패턴 장단점
    // 1. 장점
    //   1) 전역 접근 : 싱글톤 패턴으로 구현된 클래스는 어디서든지 동일한 인스턴스에 접근할 수 있음
    //      - 예를 들어, 게임의 오디오를 관리하는 SoundManager 클래스가 싱글톤으로 구현돼있다면, 
    //        모든 씬과 스크립트에서 SoundManager에 접근하여 사운드 효과를 제어할 수 있음

    //   2) 인스턴스 관리의 용이성 : 특정 객체를 한 번만 생성하고 전체에서 공유하므로 메모리를 절약할 수 있음
    
    // 2. 단점
    //   1) 전역 접근 : 여러 클래스가 싱글톤 인스턴스에 의존하게 됨
    //      - 예를 들어, 게임의 다양한 UI 클래스가 GameManager 싱글톤 인스턴스에 접근하여 데이터를 가져온다면,
    //      - 이 UI 클래스들은 GameManager에 강하게 결합되어 독립적으로 테스트하기 어려워짐
    //   2) 테스트 어려움 : 전역 인스턴스에 의존하기 때문에 단위 테스트가 어려워짐
    //   3) 유지보수 어려움 : 프로젝트 규모가 커질수록 유지보수가 어려워질 수 있음
    //      - 전역적으로 접근할 수 있다 보니 코드가 의도치 않게 얽히게 되고, 특정 싱글톤 클래스가 수정되면 전체 코드에 영향을 끼침

    // 3. 대안
    //   1) 의존성 주입
    //      - 의존성 주입(DI)을 활용하면 싱글톤의 단점을 어느정도 보완할 수 있음
    //      - 매니저 클래스를 유연하게 관리하거나, 테스트에서 결합도를 낮출 수 있음
}
