using UnityEngine;

public class ThreadMemo : MonoBehaviour
{
    // 운영체제와 프로세스
    // 운영체제 : 윈도우, 리눅스...
    // 윈도우 - 익숙하다

    // 프로세스 : 운영체제 안에서 실행되는 프로그램
    // 실행 파일에 담겨있는 데이터 및 코드가 메모리에 적재되어 동작하는 것

    // 프로세스는 반드시 하나 이상의 스레드로 구성되어진다

    // 스레드란?
    // 운영체제가 CPU에 할당하는(일을 시키는) 기본 단위
    // 운영체제가 명령어를 실행하기 위한 스케줄링 단위

    // 멀티 스레드 장점
    // 1) 동시에 여러 작업을 할 수 있다
    // 2) 데이터 공유가 쉽다 (프로그램끼리의 데이터 공유를 위해서는 소켓 등 뭔가 번거로운 구조가 필요)
    // 3) 메모리 절약 가능

    // 멀티 스레드 단점(문제)
    // 1) 구현이 복잡하다
    // 2) 소프트웨어 안정성이 떨어진다
    // 3) 성능이 저하된다

    // 운영체제 스케줄러 (단점 - 3)
    // 스레드를 골라서 CPU한테 이거 실행해 라고 명령

    // 컨텍스트 스위칭(Context Switching) / 문맥교환 : CPU가 현재 실행 중인 스레드의 상태를 저장하고,
    // 다음 실행할 스레드 상태를 불러와서 실행하는 과정
    // CPU1 >> 실행중 >> 멈추고 내가 어디까지 실행했는지 정보를 운영체제에 저장
    // >> 운영체제가 실행하라고 한 것을 실행 >> 멈춘 것을 다시 가서 실행

    // 레이스 컨디션(Race Condition) : 두 개 이상의 스레드가 공유된 자원에 동시에 접근하려고 할 때 발생하는 문제
    // 동기화 이슈(Synchronization Issues) : 레이스 컨디션을 방지하기 위해 lock을 사용해서 공유 자원을 동기화하는 방식
    // 데드락(Deadlock) : 스레드가 다른 스레드가 가진 락을 기다리고 있을 때, 데드락 발생(서로가 서로의 락이 풀릴 때까지 무한 대기)
}