using UnityEngine;

public class g_Ex : MonoBehaviour
{
    // 기초 문법 마무리

    // 1. 기초 문법 용어

    // 1) 예약어(Keyword) : C#에서 미리 정의된 단어로, 특정한 의미를 가지고 있어 변수명이나 함수명으로 사용할 수 없는 단어
    // sbyte, int, float 등

    // 2) 식별자(Identifier) : 변수명, 함수명, 클래스명 등과 같이 프로그래머가 직접 정의하는 이름
    // 변수명, 함수명, 클래스명 등
    // (1) 숫자로 시작할 수 없다.
    // (2) 공백을 포함할 수 없다.
    // (3) 특수문자는 _와 @만 사용할 수 있다.
    // (4) 한글 사용 가능 -> 권장하지 않음
    // (5) 예약어는 사용할 수 없다. -> @ 예약어는 사용할 수 있다. (예시 : @int, @float 등) => 굳이 사용 안 함

    // 3) 리터럴(Literal) : 프로그램에서 고정된 값을 나타내는 표현식 -> 소스코드에 포함된 값
    // 10, 3.14f, "Hello", 'A' 등

    // 4) 상수(Constant) : 프로그램 실행 중에 값이 변하지 않는 데이터 -> const 키워드로 선언
    // const int MAX_VALUE = 100;

    void Start()
    {
        
    }
}
