using UnityEngine;

public class g_Ex1 : MonoBehaviour
{
    // 고차원 배열은 뒤에서부터 읽기 때문에 2차원 배열은 [행, 열]로 표현되고, 3차원 배열은 [깊이, 행, 열]로 표현됩니다.

    void Start()
    {
        // [행, 열]
        int[,] arr2 = new int[4,5]
        {
            {1, 2, 3, 4, 5},    // 1차원 요소 5개
            {6, 7, 8, 9, 10},   // 2차원 요소 4개인 배열 초기화
            {11, 12, 13, 14, 15},
            {16, 17, 18, 19, 20}
        };

        // 3차원 배열도 거의 안 쓰임
        // [깊이, 행, 열]
        int[,,] arr3 = new int[2, 3, 4]
        {
            {
                {1, 2, 3, 4},   // 1차원 요소 4개
                {5, 6, 7, 8},   // 2차원 요소 3개
                {9, 10, 11, 12}
            },
            {
                {13, 14, 15, 16},
                {17, 18, 19, 20},
                {21, 22, 23, 24}
            }   // 3차원 요소 2개인 배열 초기화
        };
    }
}
