// 옵저버 패턴
// - 객체의 상태 변화를 다른 객체에게 알리는 방법을 정의
// - 주로 서브젝트(Subject)와 옵저버(Observer)로 구성되며
//   서브젝트의 상태가 변경되었을 때 관련된 옵저버들이 자동으로 그 변화를 통지받을 수 있도록 해준다
// - 유연성과 확장성을 제공하지만, 남용하면 코드 분석이 어려워질 수 있음

// 1. 옵저버 패턴 사용 이유
//   - 강한 결합(Tight Coupling)
//     ObserverTest0 클래스는 obs1, obs2를 직접 참조한다.
//     따라서 새로운 옵저버가 추가되거나 제거되면 원본 클래스(ObserverTest0)를 수정해야 함
// --> delegate를 이용한 ObserverPattern

// 2. 델리게이트는 느슨한 결합(Loose Coupling) 구조가 된다
// Subject는 Action 델리게이트를 통해 구체적으로 어떤 옵저버들에게 연결되어있는지 몰라도 됨
// 델리게이트가 연결된 메서드를 호출할 뿐이므로,
// Subject는 옵저버 클래스와 독립적이며 옵저버의 추가(+=) 제거(-=)가 쉽다

// 3. 옵저버 패턴 직접 구현(인터페이스)
// 느슨한 결합
// 서브젝트(Subject)는 구체적으로 어떤 옵저버들이 연결되어 있는지 몰라도 됨
// 연결된 옵저버들을 호출할 뿐

// ===============================================================
// 위에서 구현한 옵저버 패턴들은 Push 방식이다
// 모든 옵저버에게 Push 방식으로 서브젝트의 상태나 데이터를 전달
// 이런 방식은 옵저버가 필요로 하지 않는 정보들까지 전달할 수 있음

// Pull 방식
// 옵저버가 필요한 시점에 서브젝트의 상태나 데이터를 요청할 수 있어서 유연성이 증가함
// Subject가 하는 통보에서 끝나지 않고 Observer들이 필요한 정보를 당겨옴(Pull)
